const apple = 15.678;
const pears = 123.965;
const peaches = 90.2345;

// Використовуючи вбудований об'єкт Math – виведіть максимальне число

const maxPrice = Math.max(apple, pears, peaches);
console.log(`Максимальне число = ${maxPrice}`);

// Використовуючи вбудований об'єкт Math – виведіть мінімальне число

const minPrice = Math.min(apple, pears, peaches);
console.log(`Мінімальне число = ${minPrice}`);

// Складіть вартість всіх товарів, помістіть її в змінну та виведіть цю суму

const sumPrice = apple + pears + peaches;
console.log(`Вартість всіх товарів = ${sumPrice}`);

// Відкиньте копійки у всіх товарів, потім – складіть цілу частину вартості кожного товару між собою. Округлення використовувати в МЕНЬШУ сторону.

const sumPriceWithoutCoins =
  Math.floor(apple) + Math.floor(pears) + Math.floor(peaches);
console.log(`Сума цілих частин вартості товарів = ${sumPriceWithoutCoins}`);

// Виведіть суму товарів округлену до сотень. (Наприклад якщо вийшло 260, то виведіть 300)

const sumPriceRoundToHundreds = Math.round(sumPrice / 100) * 100;
console.log(`Сума товарів округлена до сотень = ${sumPriceRoundToHundreds}`);

// Виведіть булеве значення: чи є сума всіх товарів (округлена в меншу сторону) парним чи непарним числом?

const isEven = Math.floor(sumPrice) % 2 == 0;
console.log(
  `Сума всіх товарів (округлена в меншу сторону) є парним числом: ${isEven}`
);

// Виведіть суму решти, при оплаті всіх товарів (без округлення), якщо клієнт платить 500 грн.

const cash = 500;
const remainder = cash - sumPrice;
console.log(`Сума решти при сплаті ${cash} складає = ${remainder}`);

// Виведіть середнє значення цін, округлене до другого знаку після коми

const averagePrice = +(sumPrice / 3).toFixed(2);
console.log(`Середнє значення цін = ${averagePrice}`);

// (Більш складне) Створіть змінну, в якої збережіть випадкову знижку (використовуйте функцію Math.random).

const discount = +(Math.random() * 100).toFixed();
console.log(`Випадкова знижка = ${discount}%`);

// Зробіть клієнту випадкову знижку та виведіть суму до оплати округлену до 2 знаків після коми.

const sumWithDiscount = +(sumPrice - (discount * sumPrice) / 100).toFixed(2);
console.log(`Сума з випадковою знижкою = ${sumWithDiscount}`);

// Виведіть чистий прибуток, якщо клієнт заплатив зі знижкою та собівартість товарів рівно в два рази нижче їх ціни?
// (Приклад: ціна була 260.66, знижка склала 10%, клієнт заплатив на 26 меньше, собівартість = 260 / 2 -> 130. Чистий прибуток = 130 - 26 -> 104) (Приклад 2: ціна була 100, знижка склала 90%, клієнт заплатив на 90 меньше, собівартість = 100 / 2 -> 50. Чистий прибуток = 50 - 90 -> -40)\

// В першому прикладі не зрозуміло: спочатку ціна була 260.66 а в розрахунку собівартості 260, хоча в умові задачі чітко вказано: собівартість товарів рівно в два рази нижче їх ціни.

const profit = sumPrice / 2 - sumWithDiscount;
console.log(`Чистий прибуток = ${profit}`);

// Advanced
// Створіть шаблонний рядок та виведіть всі обчислення вчинені в Base частині домашнього завдання у вигляді одного рядка наступного вигляду:

document.writeln(`
	1. Максимальне число = ${maxPrice}; <br> 
	2. Мінімальне число = ${minPrice}; <br> 
	3. Вартість всіх товарів = ${sumPrice}; <br>
	4. Сума цілих частин вартості товарів = ${sumPriceWithoutCoins}; <br> 
	5. Сума товарів округлена до сотень = ${sumPriceRoundToHundreds}; <br>
	6. Сума всіх товарів (округлена в меншу сторону) є парним числом: ${isEven}; <br>
	7. Сума решти при сплаті ${cash} складає = ${remainder}; <br>
	8. Середнє значення цін = ${averagePrice}; <br>
	9. Випадкова знижка = ${discount}%; <br>
	10. Сума з випадковою знижкою = ${sumWithDiscount}; <br>
	11. Чистий прибуток = ${profit}. 
`);
